{
	"works":{
		"IMAC Tower Defense":
		{
			"name":"IMAC Tower Defense",
			"position":"Gameplay & UI Developer",
			"year": "2013",
			"last":"4 months",
			"video":"./videos/Imac Tower Defense.mp4",
			"images":[],
			"tags":[
				"Gameplay",
				"UI",
				"C",
				"OpenGL2"
			],
			"desc":"A 2D classic Tower Defense game. You are attack by monsters stronger and stronger and have to defend yourself.", 
			"long_desc": "Imac Tower Defense is a 2D game where you have to defend yourself against several monsters. The more you kill monsters the more you earn money to buy more powerful towers. Imac Tower Defense was developed by a team of 2 people during one month. This game was developed in C with a GUI library named AntTweakBar. I tried to implement the MVC design pattern to this game. This was one of my first project realized my first year at IMAC school of engineering."
		},		
		"Oeil de Lynx":
		{
			"name":"Oeil de Lynx",
			"position": "Unity Gameplay Developer",
			"year": "2014",
			"last":"3 months",
			"size":"medium",
			"video":"./videos/Oeil de Lynx.mp4",
			"images":[],
			"tags":[
				"Gameplay",
				"2D Animations",
				"Unity",
				"C#"
			],
			"desc":"This game will be released at the attraction park Futuroscope. You have to spot the difference on a touch terminal.", 
			"long_desc": "Spot the differences is a game that I realized during my 3 months internship at Streetlab. It is released and available at the Futuroscope attraction park. The aim of this game is to sensitize people to the visually impaired. The player has only two minutes to spot the seven differences with a scotoma on the left image. I used Unity to make this game and it is compatible with Windows (on a computer) and some Android tablets. Within the technical pole of Streetlab, I realized my missions in great autonomy. I was in charge of the game development and the 2D animations."
		},		
		"Detroit":
		{
			"name":"Detroit",
			"position": "Gameplay & Engine developer",
			"year": "2015",
			"last":"6 months",
			"images":[],
			"tags":[
				"Gameplay",
				"Engine",
				"3D Animation",
				"Camera",
				"C++",
				"Perforce"
			],
			"desc":"Detroit is the next production of the Quantic Dream studio, creator of Heavy Rain and Beyond : Two souls. I had the chance to work on it and its game engine.", 
			"long_desc": "I have coded in C++ a new camera which is already released on production. It is a camera like the Autodesk Maya one. The camera can rotate around a picked object, change the target and turn on itself. I have used matrix operations and raycasts to do this task. I have also worked on some new nodes on the animation system related to character locomotion. I have used quaternion operations for this task. Finally, I have created a prototype related to the future game of Quantic Dream. I have implemented a drone manager and drone behaviors. I have used an AI pathfinding, a state machine and matrix operations. During this internship I worked closely to the game designers.",
			"recommendations":
			{
				"Nicolas Holleville":
				{
					"name": "Nicolas Holleville",
					"position": "Lead Programmer at Quantic Dream",
					"text": "J'ai eu la chance d'encadrer Angéline dans le cadre de l'implémentation de prototypes gameplay pour un projet en cours de pré-production. </br> Elle a parfaitement su comprendre les problématiques du jeu, et proposer des solutions viables, répondant aux contraintes que lui imposaient les designers. Sa polyvalence lui permet dès à présent d'appréhender les problématiques propres aux différents métiers mis en œuvre dans le cadre de la production de jeux vidéo, et de proposer des solutions viables dans un contexte concret. </br> Dynamique, investie, et capable de livrer du code robuste et évolutif, elle représentera un atout pour toute équipe de développement.."
				},
				"Jerome Jany":
				{
					"name": "Jerome Jany",
					"position": "Animation Programmer at Quantic Dream",
					"text": "Angéline helped me improve the animation system related to character locomotion. She produced very good features, immediately usable in the final product. </br> Always willing to give the best result, she is also a very kind person to work with. Last but not least, she is also eager to learn, aiming at developing her skills in a lot of domains. </br> Definitely a great asset to have on a project."
				}				
			}
		},		
		"InsEyed":
		{
			"name":"InsEyed",
			"position": "Unity Developer",
			"year": "2015/2016",
			"last":"4 months",
			"video":"./videos/Inseyed.mp4",
			"images":[],
			"tags":[
				"AR",
				"Unity5",
				"C#",
				"zSpace",
				"UX Design"
			],
			"desc":"", 
			"long_desc": "Application made with Unity 5 in Augmented Reality with the technology zSpace. On this project I have programmed in C# and also participated in the UX design. This experience shows to the students how the vision is working and which are the visual impairment."
		},		
		"CINEVR":
		{
			"name":"CINEVR",
			"position": "Creative Technologist & VR developer",
			"year": "currently working on it",
			"last":"1 year",
			"video":"",
			"images":[],
			"tags":[
				"VR",
				"Unity5",
				"GearVR",
				"Cardboard",
				"Substance Painter",
				"3DCoat",
				"Network"
			],
			"desc":"I am currently working on CINEVR, an experience which allows you to play videos in a virtual reality cinema.", 
			"long_desc": "CINEVR is an experience which allows you to play videos in a virtual reality cinema. Development of the CINEVR application with Unity 5 (GearVR & Android cardboard). Realization of 3D and 2D assets in 3D Coat, Modo and Substance Painter. Implementation of a multiplayer network with Photon PUN."
		},
		"FnacPlay VR":
		{
			"name":"FnacPlay VR",
			"last":"1 months",
			"video":"",
			"images":[],
			"tags":[
				"VR",
				"Unity5",
				"GearVR",
				"Cardboard",
				"Substance Painter",
				"3DCoat",
				"Network"
			],
			"desc":"I am currently working on CINEVR, an experience which allows you to play videos in a virtual reality cinema.",
			"long_desc":""
		}
	}
}